***********************************************************************
* LSVSET: MERIDIAN HOME LENDING LOAN SERVICING, AS BMS MAPS.
* THE SCREENS OF THE ORBIT LOAN-SERVICING TWIN (DEMO/TERMINAL-PORTAL),
* LAID OUT THE SAME: SAME CODES, LABELS, POSITIONS AND KEY LEGENDS.
* GENERATED; SEE DEMO/MVS/README.MD.
LSVSET   DFHMSD TYPE=&SYSPARM,                                         X
               LANG=COBOL,                                             X
               MODE=INOUT,                                             X
               TERM=3270-2,                                            X
               CTRL=FREEKB,                                            X
               STORAGE=AUTO,                                           X
               TIOAPFX=YES
***********************************************************************
LSV00M   DFHMDI SIZE=(24,80),                                          X
               LINE=1,                                                 X
               COLUMN=1
         DFHMDF POS=(1,1),                                             X
               LENGTH=5,                                               X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='LSV00'
         DFHMDF POS=(1,28),                                            X
               LENGTH=21,                                              X
               ATTRB=(BRT,PROT),                                       X
               INITIAL='MERIDIAN HOME LENDING'
U00      DFHMDF POS=(1,70),                                            X
               LENGTH=8,                                               X
               ATTRB=(NORM,PROT)
         DFHMDF POS=(2,26),                                            X
               LENGTH=14,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='LOAN SERVICING'
         DFHMDF POS=(10,2),                                            X
               LENGTH=39,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='TRAINING SYSTEM. NO LIVE BORROWER DATA.'
M00      DFHMDF POS=(21,1),                                            X
               LENGTH=78,                                              X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(23,1),                                            X
               LENGTH=14,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='ENTER=CONTINUE'
***********************************************************************
LSV10M   DFHMDI SIZE=(24,80),                                          X
               LINE=1,                                                 X
               COLUMN=1
         DFHMDF POS=(1,1),                                             X
               LENGTH=5,                                               X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='LSV10'
         DFHMDF POS=(1,28),                                            X
               LENGTH=21,                                              X
               ATTRB=(BRT,PROT),                                       X
               INITIAL='MERIDIAN HOME LENDING'
U10      DFHMDF POS=(1,70),                                            X
               LENGTH=8,                                               X
               ATTRB=(NORM,PROT)
         DFHMDF POS=(2,26),                                            X
               LENGTH=24,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='LOAN SERVICING - INQUIRY'
         DFHMDF POS=(5,2),                                             X
               LENGTH=16,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='LOAN NUMBER ===>'
LOANNO   DFHMDF POS=(5,19),                                            X
               LENGTH=12,                                              X
               ATTRB=(NORM,UNPROT,IC,FSET)
         DFHMDF POS=(5,32),                                            X
               LENGTH=1,                                               X
               ATTRB=(ASKIP)
M10      DFHMDF POS=(21,1),                                            X
               LENGTH=78,                                              X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(23,1),                                            X
               LENGTH=69,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='ENTER=INQUIRE  PF4=BOARD A NEW LOAN  PF6=BORROWX
               ER LOANS  PF3=SIGN OFF'
***********************************************************************
LSV20M   DFHMDI SIZE=(24,80),                                          X
               LINE=1,                                                 X
               COLUMN=1
         DFHMDF POS=(1,1),                                             X
               LENGTH=5,                                               X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='LSV20'
         DFHMDF POS=(1,28),                                            X
               LENGTH=21,                                              X
               ATTRB=(BRT,PROT),                                       X
               INITIAL='MERIDIAN HOME LENDING'
U20      DFHMDF POS=(1,70),                                            X
               LENGTH=8,                                               X
               ATTRB=(NORM,PROT)
         DFHMDF POS=(2,26),                                            X
               LENGTH=28,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='LOAN SERVICING - LOAN DETAIL'
         DFHMDF POS=(4,2),                                             X
               LENGTH=14,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='LOAN NUMBER  :'
DLOAN    DFHMDF POS=(4,17),                                            X
               LENGTH=12,                                              X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(4,41),                                            X
               LENGTH=12,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='STATUS     :'
DSTAT    DFHMDF POS=(4,54),                                            X
               LENGTH=24,                                              X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(5,2),                                             X
               LENGTH=14,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='BORROWER     :'
DBORR    DFHMDF POS=(5,17),                                            X
               LENGTH=24,                                              X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(7,2),                                             X
               LENGTH=14,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='PROGRAM      :'
DPROG    DFHMDF POS=(7,17),                                            X
               LENGTH=12,                                              X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(7,41),                                            X
               LENGTH=12,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='LOAN AMOUNT:'
DAMT     DFHMDF POS=(7,54),                                            X
               LENGTH=14,                                              X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(8,2),                                             X
               LENGTH=14,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='PROPERTY     :'
DPROP    DFHMDF POS=(8,17),                                            X
               LENGTH=23,                                              X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(8,41),                                            X
               LENGTH=12,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='FLOOD ZONE :'
DFLOOD   DFHMDF POS=(8,54),                                            X
               LENGTH=2,                                               X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(9,2),                                             X
               LENGTH=14,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='LTV          :'
DLTV     DFHMDF POS=(9,17),                                            X
               LENGTH=6,                                               X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(9,41),                                            X
               LENGTH=12,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='DTI        :'
DDTI     DFHMDF POS=(9,54),                                            X
               LENGTH=6,                                               X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(10,2),                                            X
               LENGTH=14,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='FICO         :'
DFICO    DFHMDF POS=(10,17),                                           X
               LENGTH=3,                                               X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(10,41),                                           X
               LENGTH=12,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='RESERVES   :'
DRES     DFHMDF POS=(10,54),                                           X
               LENGTH=7,                                               X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(11,2),                                            X
               LENGTH=14,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='FIRST-TIME   :'
DFIRST   DFHMDF POS=(11,17),                                           X
               LENGTH=1,                                               X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(11,41),                                           X
               LENGTH=12,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='EDUCATION  :'
DEDUC    DFHMDF POS=(11,54),                                           X
               LENGTH=24,                                              X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(12,2),                                            X
               LENGTH=14,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='EMPLOYMENT   :'
DEMPL    DFHMDF POS=(12,17),                                           X
               LENGTH=16,                                              X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(12,41),                                           X
               LENGTH=12,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='NOTE RATE  :'
DRATE    DFHMDF POS=(12,54),                                           X
               LENGTH=6,                                               X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(14,2),                                            X
               LENGTH=20,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='CONDITIONS ON FILE :'
DCOND    DFHMDF POS=(14,23),                                           X
               LENGTH=48,                                              X
               ATTRB=(BRT,PROT)
M20      DFHMDF POS=(21,1),                                            X
               LENGTH=78,                                              X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(23,1),                                            X
               LENGTH=50,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='PF3=RETURN  PF5=APPROVE  PF6=REFER  PF7=ATTACH X
               PMI'
         DFHMDF POS=(24,1),                                            X
               LENGTH=66,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='PF8=ATTACH RESERVES  PF9=ATTACH FLOOD INS  PF10X
               =ATTACH TAX RETURNS'
***********************************************************************
LSV40M   DFHMDI SIZE=(24,80),                                          X
               LINE=1,                                                 X
               COLUMN=1
         DFHMDF POS=(1,1),                                             X
               LENGTH=5,                                               X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='LSV40'
         DFHMDF POS=(1,28),                                            X
               LENGTH=21,                                              X
               ATTRB=(BRT,PROT),                                       X
               INITIAL='MERIDIAN HOME LENDING'
U40      DFHMDF POS=(1,70),                                            X
               LENGTH=8,                                               X
               ATTRB=(NORM,PROT)
         DFHMDF POS=(2,26),                                            X
               LENGTH=33,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='LOAN SERVICING - BOARD A NEW LOAN'
         DFHMDF POS=(5,2),                                             X
               LENGTH=17,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='LOAN NUMBER  ===>'
BLOAN    DFHMDF POS=(5,20),                                            X
               LENGTH=12,                                              X
               ATTRB=(NORM,UNPROT,IC,FSET)
         DFHMDF POS=(5,33),                                            X
               LENGTH=1,                                               X
               ATTRB=(ASKIP)
         DFHMDF POS=(6,2),                                             X
               LENGTH=17,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='BORROWER     ===>'
BBORR    DFHMDF POS=(6,20),                                            X
               LENGTH=24,                                              X
               ATTRB=(NORM,UNPROT,FSET)
         DFHMDF POS=(6,45),                                            X
               LENGTH=1,                                               X
               ATTRB=(ASKIP)
         DFHMDF POS=(7,2),                                             X
               LENGTH=17,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='LOAN AMOUNT  ===>'
BAMT     DFHMDF POS=(7,20),                                            X
               LENGTH=12,                                              X
               ATTRB=(NORM,UNPROT,FSET)
         DFHMDF POS=(7,33),                                            X
               LENGTH=1,                                               X
               ATTRB=(ASKIP)
         DFHMDF POS=(8,2),                                             X
               LENGTH=17,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='NOTE RATE    ===>'
BRATE    DFHMDF POS=(8,20),                                            X
               LENGTH=6,                                               X
               ATTRB=(NORM,UNPROT,FSET)
         DFHMDF POS=(8,27),                                            X
               LENGTH=1,                                               X
               ATTRB=(ASKIP)
         DFHMDF POS=(9,2),                                             X
               LENGTH=17,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='PROGRAM      ===>'
BPROG    DFHMDF POS=(9,20),                                            X
               LENGTH=4,                                               X
               ATTRB=(NORM,UNPROT,FSET)
         DFHMDF POS=(9,25),                                            X
               LENGTH=18,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='(CONV FHA VA JUMB)'
BACCTL   DFHMDF POS=(12,2),                                            X
               LENGTH=19,                                              X
               ATTRB=(BRT,PROT)
BACCT    DFHMDF POS=(12,22),                                           X
               LENGTH=7,                                               X
               ATTRB=(BRT,PROT)
M40      DFHMDF POS=(21,1),                                            X
               LENGTH=78,                                              X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(23,1),                                            X
               LENGTH=24,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='PF3=RETURN   PF10=SUBMIT'
***********************************************************************
LSV50M   DFHMDI SIZE=(24,80),                                          X
               LINE=1,                                                 X
               COLUMN=1
         DFHMDF POS=(1,1),                                             X
               LENGTH=5,                                               X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='LSV50'
         DFHMDF POS=(1,28),                                            X
               LENGTH=21,                                              X
               ATTRB=(BRT,PROT),                                       X
               INITIAL='MERIDIAN HOME LENDING'
U50      DFHMDF POS=(1,70),                                            X
               LENGTH=8,                                               X
               ATTRB=(NORM,PROT)
         DFHMDF POS=(2,26),                                            X
               LENGTH=31,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='LOAN SERVICING - BORROWER LOANS'
         DFHMDF POS=(4,2),                                             X
               LENGTH=13,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='BORROWER ===>'
XBORR    DFHMDF POS=(4,16),                                            X
               LENGTH=24,                                              X
               ATTRB=(NORM,UNPROT,IC,FSET)
         DFHMDF POS=(4,41),                                            X
               LENGTH=1,                                               X
               ATTRB=(ASKIP)
XCNTL    DFHMDF POS=(6,2),                                             X
               LENGTH=21,                                              X
               ATTRB=(BRT,PROT)
XCNT     DFHMDF POS=(6,24),                                            X
               LENGTH=3,                                               X
               ATTRB=(BRT,PROT)
XWORSTL  DFHMDF POS=(7,2),                                             X
               LENGTH=21,                                              X
               ATTRB=(BRT,PROT)
XWORST   DFHMDF POS=(7,24),                                            X
               LENGTH=3,                                               X
               ATTRB=(BRT,PROT)
XHEAD    DFHMDF POS=(9,2),                                             X
               LENGTH=45,                                              X
               ATTRB=(BRT,PROT)
XLINE1   DFHMDF POS=(10,2),                                            X
               LENGTH=45,                                              X
               ATTRB=(BRT,PROT)
XLINE2   DFHMDF POS=(11,2),                                            X
               LENGTH=45,                                              X
               ATTRB=(BRT,PROT)
XLINE3   DFHMDF POS=(12,2),                                            X
               LENGTH=45,                                              X
               ATTRB=(BRT,PROT)
M50      DFHMDF POS=(21,1),                                            X
               LENGTH=78,                                              X
               ATTRB=(BRT,PROT)
         DFHMDF POS=(23,1),                                            X
               LENGTH=26,                                              X
               ATTRB=(NORM,PROT),                                      X
               INITIAL='ENTER=INQUIRE   PF3=RETURN'
***********************************************************************
         DFHMSD TYPE=FINAL
         END
